module.exports = {
  USER_TYPE: ['在校学生', '教师职工'],
  SPORT_TYPE: ['羽毛球', '乒乓球', '篮球'],
  WEEK_DAY: ['周一', '周二', '周三', '周四', '周五', '周六', '周日'],
  RESERVATION_TIME: ['6:30', '8:00', '9:00', '10:00', '11:00', '11:30', '12:00', '13:00', '14:00', '15:00', '16:00', '17:00', '18:00', '18:30', '19:00', '20:00', '20:30', '21:00', '22:00', '22:30'],
  RESPONSE_MSG: {
    0: '操作成功。',
    1000: '请求错误，如请求方法有误。',
    1001: '服务器错误，如多次重试仍报错请联系开发者。',
    1002: '输入信息格式有误或为空，请仔细检查并修改重试。',
    1003: '未登录或用户登录状态已过期，请重新登录。',
    1004: '密钥错误，未认证任务机。',
    1005: '您要新建的对象已存在，请检查输入信息。',
    1006: '清华账户验证错误，可能是账号密码输入有误，或清华认证平台出错。',
    1007: '微信授权码有误或过期，请尝试重新登录。',
    1008: '微信平台认证错误，请尝试重新登录。'
  },
  SERVER_BASE_URL: 'https://thu.stadium.huhaoyu.com/',
  DEFAULT_MODAL_TITLE: '预约助手提示',
  VERSION: '1.0',
  
  status: {
    OK: 0,
    UNAUTHORIZED: 401
  }
}